
# Задание 1:
    # Нужно создать обычный калькулятор состоящий из знаков +,-,*,/
    # 1. У пользователя просят выбрать знак
    # 2. Просят ввести 1 число
    # 3. Просят ввести 2 число
    # 4. Вывести результат
    # 5. После результата спросить у пользователя хочет он закончить или нет, если нет то калькулятор должен запускатся сначала
    # 6. Учесть то что деление на ноль невозможно

# number = int(input('Введите 1 число: '))
# number1 = int(input('Введите 2 число: '))
# operation = input ('Выберите операцию: (+,-,**,/,*)')

# if operation == '+': 
#     print(number + number1)
# elif operation == '-':
#     print(number - number1)
# elif operation == '**':
#     print(number ** number1)
# elif operation ==  '*':
#     print(number * number1)
# elif operation == '/':

    
#     if number or number1 != 0:
#         print(number / number1)
#     else:
#         print('нельзя на 0')



# Задание 2:
    # Даны три переменные "A", "B" и "C". 
    # Изменить значения этих переменных так, чтобы в "A" хранилось значение "A"+"B", 
    # в "B" хранилась разность старых значений "C" - "A", 
    # а в "C" хранилось сумма старых значений "A" + "B" + "C". 
    # Например, A=0, B=2, C=5, тогда новые значения A=2, B=5 и C=7.

# a = int(input('1 число: '))
# b = int(input('2 число: '))
# c = int(input('3 число: '))

# A = a
# B = b 
# C = c

# a = A + B
# b = C - A
# c = A + B + C

# print('a =',a,'b =',b,'c =',c)

# Задание 3:
    # Пользователь вводит сторону квадрата. Найдите периметр и площадь квадрата.

# A = int(input("Длина: "))
# B = int(input("Ширина: "))

# c = A * B;
# p = (A + B) * 2;

# print('Площадь: ', c, 'Периметр: ',p)



# Задание 4:
    # Вам даны несколько последовательностей чисел:
    # sequence_0 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0]
    # sequence_1 = [14,10,35,45,'60',70,90,0,105,150,'70']
    # sequence_2 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0.0]
    # sequence_3 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70']
    # Нужно проверить, все ли числа в КАЖДОЙ последовательности уникальны.
    # Если в последовательности были найдены дубликаты ---> Выведите на экран: "Последовательность не уникальна."
    # Если в последовательности дубликатов найдено не было ---> Выведите на экран: "Последовательность уникальна."
    # Если в решении задания не присутствует цикл ---> Задание не защитано.


# sequence_0 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0]
# sequence_1 = [14,10,35,45,'60',70,90,0,105,150,'70']
# sequence_2 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0.0]
# sequence_3 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70']



# Задание 5:
#     Дано список 
#     nums = [137, 168, 100, 90, 60]
#     Вывести на экран сумму всех чисел из списка


nums = [137, 168, 100, 90, 60]

print(sum(nums))