
################################################################################
# Задание 1:
    # Напишите программу, которая циклично запрашивает у пользователя любой символ
    # и выводит соответствующие им символы. 
    # Завершает работу при вводе нуля.
################################################################################




################################################################################
# Задание 2:
    # Создайте input() который принимает от пользователя дату в формате: "2020-10-24 18:30" и возвращает dictionary разделённую по значениям даты:
    # date = {
    # "year": "2020",
    # "month": "10",
    # .....
    # }
################################################################################



# a = input('Введите дату: ')

# date = {
#     'year': a[0:4],
#     'month': a[5:7],
#     'day': a[8:10],
#     'time': a[10:13],
#     'minute': a[14:16],
#     'second': a[17:19]
# }

# print(date ) 



################################################################################
# Задание 3:
    # Вам дан SET значений:
    # uniques = {3,13,15,27,1,4,8,23,19,12,9,2,17}
    # Создайте функцию которая:
        # Удалит все чётные значения внутри SET, а оставшиеся отсортирует по убыванию.
    # В результате, ваша функция должна вернуть отсортированный LIST убыванию.
################################################################################

# uniques = {3,13,15,27,1,4,8,23,19,12,9,2,17}
# def sps(x):
#     for i in ls:
#         s = i %2
#         if s == 0 :
#             ls.remove(i)
#     print(ls[::-1])
# ls = list(uniques)
# ls.remove(8)

# sps(ls)


################################################################################
# Задание 4:
#     Дано список 
#     nums = [137, 168, 100, 90, 60, 500]
#     Найти максимум из списка
#     Решение должно производится с помощью цикла while  
#################################################################################

nums = [137, 168, 100, 90, 60, 500]
nums.sort()

a = 0
mx = nums[a]
while a < len(nums):
    if mx < nums[a]:
        mx = nums[a]

    a = a + 1

print(mx)