
# Задача 1

# fruits = {
#    'алма':'🍎',
#    'дарбыз':'🍉',
#    'дыня':'🍈',
#    'помидор': '🍅',
#    'кулпунай': '🍓',
#    'банан': '🍌'
# }

# fructs = input('Выберите виды фруктов: ')
# fructs_1 = input('Выберите виды фруктов: ')
# fructs_2 = input('Выберите виды фруктов: ')

# if fructs in fruits and fructs_1 in fruits and fructs_2 in fruits:
#     print(fruits[fructs], fruits[fructs_1], fruits[fructs_2])



# Задача 2

# season = int(input(':'))


# if season == 3 < 5:
#     print('весна')

# if season == 6 < 8:
#     print('лето')

# if season == 9 < 11:
#     print('осень')

# if season == 0 < 2:
#     print('зима')



# Задача 3

# def deposit(money, year):
#     depo_st = (money * 0.15) * year
#     result = money + depo_st

#     print('За {0} года деньги увеличились на {1} '.format(year, result))

# mon = int(input('Количество денег на депозит ставка 15% за год: '))
# year = int(input('На сколько лет: '))

# deposit(mon, year)

#Задача 4

# a = [1, 1, 2, 3, 5, 9, 8, 13, 21, 34, 55, 89, 75]
# for elem in a:
#     if elem < 9:
#         print(elem)


#Задача 5

# lst = [100, 29, 33, 44, 32, 65, 345, 99, 900, 32]

# a= lst[0]
# t = lst[-1]

# print(t,a)