
# Задача 1.
# Дан список продуктов products.
# Как раз в магазине проходит скидка в размере 15% на весь товар
# Вычислите сколько денег нужно чтобы купить весь товар ?
# products = {
#     'утюг': 3500,
#     'телевизор': 24000,
#     'стиральная_машина': 30000,
#     'фен': 5500
# }
# s = (products['фен']+products['утюг']+products['телевизор']+products['стиральная_машина'])   
# b = (s*0.15)
# t = (s-b)
# print(s)
# print(t)



# Задание 2
# Дано целое число из трёх цифр.
# Напечатайте сумму цифру числа.
# Пример ввода
# 123
# Пример вывода
# 6
#------------------------------------------------
# a = input('Введите число: ')
# g = int(a[0])
# b = int(a[1])
# c = int(a[2])


# print("Сумма цифр числа:", g + b + c)



# Задание 3
# Дано целое двузначное число.
# Напечатайте число, в котором правая и левая цифры поменяны местами.
# Пример ввода
# 79
# Пример вывода
# 97
#---------------------------------------------------
# a = input('Введите двузначное число: ')
# a2 = a[::-1]
# print('Пример вывода)', a2)