text = '''
Степан Аркадьич взял шляпу и остановился, припоминая, не забыл ли чего. Оказалось, что он ничего не забыл, кроме того, что хотел забыть, — жену.
"Ах да!" Он опустил голову, и красивое лицо его приняло тоскливое выражение. "Пойти или не пойти?" — говорил он себе. И внутренний голос говорил ему, что ходить не надобно, что, кроме фальши, тут ничего быть не может, что поправить, починить их отношения невозможно, потому что невозможно сделать ее опять привлекательною и возбуждающею любовь или его сделать стариком, не способным любить. Кроме фальши и лжи, ничего не могло выйти теперь; а фальшь и ложь были противны его натуре.
'''

words = text.split('')
print(words[10])
